app/views/assignments/_assignment_list.html.erb

<% course.assignments.each do |a| %>
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."course_id" = $1  [["course_id", 1]]