app/views/assignments/show.html.erb

<%= button_to "New Problem", new_assignment_problem_path(@assignment), :method => :get %>
<% @assignment.problems.each do |p| %>
---
SELECT "problems".* FROM "problems" WHERE "problems"."assignment_id" = ?  [["assignment_id", 1]]