app/views/problems/_problem_list.html.erb

SELECT "problems".* FROM "problems" WHERE "problems"."assignment_id" = $1  [["assignment_id", 1]]
---
<% assignment.problems.each do |p| %>