app/controllers/assignments_controller.rb

	def create
		raise "Unauthorized Access! You must be an admin to do this." unless current_user.admin
		@assignment = @course.assignments.build(assignment_params)
		@assignment.course = @course
		@assignment.creator = current_user
		respond_to do |format|
			if @assignment.save
---
INSERT INTO "assignments" ("name", "due", "course_id", "creator_id") VALUES (?, ?, ?, ?)  [["name", "Assignment 1"], ["due", "2016-01-02 01:00:00.000000"], ["course_id", 1], ["creator_id", 1]]

	def show
		@assignment = @course.assignments.find(params[:id])
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."course_id" = ? AND "assignments"."id" = ? LIMIT 1  [["course_id", 1], ["id", 1]]

	def load_course
		if (params[:course_id])
			@course = Course.find(params[:course_id])
		else
			@course = Assignment.find(params[:id]).course
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", nil]]