app/controllers/assignments_controller.rb

	def create
		raise "Unauthorized Access! You must be an admin to do this." unless current_user.admin
		@assignment = @course.assignments.build(assignment_params)
		@assignment.course = @course
		@assignment.creator = current_user
		respond_to do |format|
			if @assignment.save
---
INSERT INTO "assignments" ("name", "due", "course_id", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Assignment 1"], ["due", "2016-01-04"], ["course_id", 1], ["creator_id", 1], ["created_at", "2016-01-04 12:17:07.142304"], ["updated_at", "2016-01-04 12:17:07.142304"]]

	def load_course
		if (params[:course_id])
			@course = Course.find(params[:course_id])
		else
			@course = Assignment.find(params[:id]).course
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."course_id" = $1  [["course_id", 1]]