app/controllers/courses_controller.rb

INSERT INTO "courses" ("code", "name", "creator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["code", "CS137"], ["name", "Programming Principles"], ["creator_id", 1], ["created_at", "2015-11-05 23:27:06.227850"], ["updated_at", "2015-11-05 23:27:06.227850"]]
---
	def create
		raise "Unauthorized Access! You must be an admin to do this." unless current_user.admin
		@course = Course.new(course_params)
		@creator = current_user
		@course.creator = @creator
		@courses = Course.all
		respond_to do |format|
			if @course.save