app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
INSERT INTO "courses" ("code", "name", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["code", "CS138"], ["name", "Introduction to Data Abstraction and Implementation"], ["creator_id", 1], ["created_at", "2016-01-04 12:16:53.160795"], ["updated_at", "2016-01-04 12:16:53.160795"]]
---
	def create
		raise "Unauthorized Access! You must be an admin to do this." unless current_user.admin
		@course = Course.new(course_params)
		@creator = current_user
		@course.creator = @creator
		@courses = Course.all
		respond_to do |format|
			if @course.save