app/controllers/problems_controller.rb

INSERT INTO "problems" ("name", "assignment_id", "creator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Problem 1"], ["assignment_id", 1], ["creator_id", 1], ["created_at", "2015-11-05 23:28:09.266275"], ["updated_at", "2015-11-05 23:28:09.266275"]]
---
	def create
		@problem = @assignment.problems.build(problem_params)
		@problem.assignment = @assignment
		@problem.creator = current_user
		respond_to do |format|
			if @problem.save

SELECT  "problems".* FROM "problems" WHERE "problems"."assignment_id" = ? AND "problems"."id" = ? LIMIT 1  [["assignment_id", 1], ["id", 1]]
SELECT "source_codes".* FROM "source_codes" WHERE "source_codes"."owner_id" = 1 AND "source_codes"."problem_id" = 1
---
	def show
		@problem = @assignment.problems.find(params[:id])
		@source_code = SourceCode.new
		@user = current_user
		flash[:success] = "The source code has been uploaded!"
		flash[:failure] = "There was a problem uploading."
		@sources = SourceCode.where(owner: @user, problem: @problem)

SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", nil]]
---
  	def load_assignment
  		if (params[:assignment_id])
  			@assignment = Assignment.find(params[:assignment_id])
  		else
  			@assignment = Problem.find(params[:id]).assignment