app/controllers/source_codes_controller.rb

	def show
		@source_code = SourceCode.find(params[:id])
---
SELECT  "source_codes".* FROM "source_codes" WHERE "source_codes"."id" = ? LIMIT 1  [["id", 3]]

	def create
		@source_code = SourceCode.new(source_params)
		respond_to do |format|
			if @source_code.save
---
INSERT INTO "source_codes" ("name", "attachment", "owner_id", "problem_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test"], ["attachment", "certenroll.log"], ["owner_id", 1], ["problem_id", 1], ["created_at", "2015-11-06 22:34:10.556998"], ["updated_at", "2015-11-06 22:34:10.556998"]]