app/controllers/test_cases_controller.rb

	def create
		@test_case = @problem.test_cases.build(test_case_params)
		@test_case.problem = @problem
		@test_case.legal = true
		@test_case.creator = current_user
		respond_to do |format|
			if @test_case.save && @problem.add_test_case(@test_case)
---
INSERT INTO "test_cases" ("input", "output", "problem_id", "legal", "creator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["input", "1"], ["output", "2"], ["problem_id", 1], ["legal", "t"], ["creator_id", 1], ["created_at", "2015-11-05 23:28:14.685262"], ["updated_at", "2015-11-05 23:28:14.685262"]]

	def show
		@test_case = @problem.test_cases.find(params[:id])
---
SELECT  "test_cases".* FROM "test_cases" WHERE "test_cases"."problem_id" = ? AND "test_cases"."id" = ? LIMIT 1  [["problem_id", 2], ["id", 3]]

  	def load_problem
  		if (params[:problem_id])
  			@problem = Problem.find(params[:problem_id])
---
SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", 2]]